/*
ÀüÃ³¸®±â
ÄÄÆÄÀÏ·¯°¡ ¼Ò½ºÄÚµå¸¦ ÄÄÆÄÀÏ ÇÏ±âÀü¿¡ ¹Ì¸® ¼±ÇàÃ³¸®ÇÏ´Â°Í
complie Àü Ã³¸® >> ¾î¶² µ¿ÀÛÀ» ÇÏ´Âµ¥ ¹«¾ùÀ» ÇÒ ¼ö ÀÖÀ»±îÀÇ ÀÇ¹®À» µÖ¾ß ÇÑ´Ù!!
ÁÖµ¿ÀÛÀº ÄÚµåÀÇ º¯ÇüÀ» ÇÑ´Ù!!(Å¸ÀÚ , ÆíÁı±â) 
cpuÀÇ ¿¬»ê°ú´Â ¾Æ¹« »ó°üÀÌ ¾ø´Ù!! 
¿ÀÁ÷ ÄÄÆÄÀÏ Å¸ÀÓ¿¡¸¸ ½Å°æ¾´´Ù!!

#include <~~.h>	¾îµğ¼±°¡ °Ë»öÀ» ÇØ¼­ °¡Áö°í ¿À´Âµ¥ ÄÄÆÄÀÏ·¯ ¼³Á¤¾È ½Ã½ºÅÛ directory(Æú´õ)¾È¿¡ ¯¾Æ¼­ ÁØ´Ù!!(¼Ó¼º¿¡ Æ÷ÇÔµğ·ºÅä¸®¿¡¼­ °¡Áö°í ¿Â´Ù!!)
#include ""		ÇöÀç Æú´õ¿¡¼­ °Ë»öÈÄ¿¡ °¡Áö°í ¿Â´Ù!!

Çì´õ ÆÄÀÏ ¼±¾ğ½Ã ¹«Á¶°Ç #pragma once ÀÛ¼ºÇÏ¿© ÀüÃ³¸®±âÇÑµ¥ ¾Ë·Á Áà¾ßÇÑ´Ù!!
¿øÇü ¼±¾ğÀ» ÇÑ¹ø¿¡ ~~.h¿¡ ÇØµµ »ó°ü ¾ø´Ù!!

Á¶°ÇºÎ ÀüÄ¡¸®±â #ifdef ,#else , #endif

ÆÁ
¼±¾ğÀº n¹ø °¡´ÉÇÏ¸ç Á¤ÀÇ´Â 1È¸¸¸ °¡´É!!
¼±¾ğµé¸¸ ¸ğ¾Æ¼­ ~~.h·Î ¸¸µå´Àµ¥ includeÇÏ°Ô µÇ¸é ¼ÕÀ¸·Î Á÷Á¢ ÀÛ¼ºÇÑ°Í°ú ¶È°°´Ù!!
Çì´õ´Â ¾î¶² ¼±¾ğÀÌ Æ÷ÇÔµÇ¾î ÀÖ´Ù°í »ı°¢ÇÏ¸é µÈ´Ù!!

*/
#include <stdio.h>
#include "TestPrintFunc.h"

//¸ÅÅ©·Î , __inlineÀº Äİ½ºÅÃ¿¡ Ã¤¿öÁöÁö ¾Ê´Â´Ù!! ÄÄÆÄÀÏ·¯°¡ ¾Ë¾Æ¼­ ½ÃµµÇÑ´Ù!!
//#define ADD(a,b)	(a+b)
#define _TEST_

void Testfunc(int);
void TestFunc_New(int nParam);
//__inlineÀº ÇÔ¼ö°¡ ÀÚÁÖÈ£ÃâÇÏ´Âµ¥ ³»ºÎ ·ÎÁ÷Àº º¹Àâ¼ºÀÌ ³ôÁö ¾ÊÀ»¶§ ÄÄÆÄÀÏ·¯°¡ ½º½º·Î ½ºÅÃ ÇÁ·¹ÀÓ¿¡ Ã¤¿ìÁö ¾Ê°í ¼ö¿ùÇÏ°Ô µ¿ÀÛÀ» ÇÏ±â À§ÇØ¼­ ½Ã¿ëÇÑ´Ù
__inline int ADD(int a, int b) {
	return a + b;
}


int main(void) {
#ifdef _TEST_
	Testfunc(100);
	TestFunc_New(1000);
#else
	TestPrintFunc(10);
#endif
	printf("¸ÅÅ©·Î ÇÔ¼ö »ç¿ë %d", ADD(10, 20));
	return 0;
}